Autodesk.Navisworks.Api.Schema.UnitGroup
Represents the unit group (eg. length, volume, angle, etc) of the field value.

Autodesk.Navisworks.Api.Schema.UnitGroup.None
No unit group specified (default).

Autodesk.Navisworks.Api.Schema.UnitGroup.Length
Unit group is length.

Autodesk.Navisworks.Api.Schema.UnitGroup.Area
Unit group is area.

Autodesk.Navisworks.Api.Schema.UnitGroup.Volume
Unit group is volume.

Autodesk.Navisworks.Api.Schema.UnitGroup.Angle
Unit group is angle.